# Multy Index Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
# 나쁜 예
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
# MultyIndex 지정
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [5]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [6]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

## extra dimension

In [7]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [8]:
# pop_df.stack()

In [9]:
pop_df =  pd.DataFrame({'total' : pop, 'under18' : [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [10]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

# MultyIndex 생성 방법

In [11]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.804646  0.397941
  2  0.250783  0.170427
b 1  0.925954  0.936540
  2  0.871437  0.261799

In [12]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

## 인덱스 이름

In [13]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

## Columns MultiIndex

In [14]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      18.0  36.8  38.0  37.7  32.0  36.5
     2      51.0  37.4  38.0  36.6  51.0  36.7
2014 1      50.0  38.2  59.0  35.2  44.0  36.6
     2      48.0  36.6  40.0  37.1  39.0  35.3

In [15]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      38.0  37.7
     2      38.0  36.6
2014 1      59.0  35.2
     2      40.0  37.1

# MultiIndex의 Indexing & Slicing

In [16]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [17]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [39]:
pop.loc['California':'Texas']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [19]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [36]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

## DataFrame Index 곱하기

In [21]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      18.0  36.8  38.0  37.7  32.0  36.5
     2      51.0  37.4  38.0  36.6  51.0  36.7
2014 1      50.0  38.2  59.0  35.2  44.0  36.6
     2      48.0  36.6  40.0  37.1  39.0  35.3

In [22]:
health_data['Guido', 'HR']

year  visit
2013  1        38.0
      2        38.0
2014  1        59.0
      2        40.0
Name: (Guido, HR), dtype: float64

In [ ]:
health_data.loc[:, ('Bob', 'HR')].unstack()

visit     1     2
year
2013   18.0  51.0
2014   50.0  48.0

In [24]:
health_data['Bob', 'HR'].unstack()

visit     1     2
year
2013   18.0  51.0
2014   50.0  48.0

In [25]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      18.0  38.0  32.0
2014 1      50.0  59.0  44.0

# Rearranging Multi Index

In [44]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.455805
      2      0.310118
c     1      0.221557
      2      0.276836
b     1      0.466171
      2      0.932944
dtype: float64

In [27]:
data = data.sort_index()
data

char  int
a     1      0.254747
      2      0.716027
b     1      0.996967
      2      0.201227
c     1      0.605081
      2      0.167030
dtype: float64

In [28]:
data['a':'b']

char  int
a     1      0.254747
      2      0.716027
b     1      0.996967
      2      0.201227
dtype: float64

In [29]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [30]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

## Index setting and resetting

In [31]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [32]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561